
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_application_insights.web
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.app_insights_instrumentation_key
  * module.citizen-ui-draft-store.azurerm_redis_cache.redis
* Delete
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.web will be created
  + resource "azurerm_application_insights" "web" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "civil-citizen-ui-aat"
      + resource_group_name                   = "civil-citizen-ui-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "civil"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://civil-cui-aat.vault.azure.net/secrets/appinsights-connection-string/a4ee306f96f34c69a903e4240187216e"
        name                    = "appinsights-connection-string"
        tags                    = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "appinsights civil-citizen-ui-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_instrumentation_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_instrumentation_key" {
        id                      = "https://civil-cui-aat.vault.azure.net/secrets/appinsights-instrumentation-key/2820b5ee466c4353afea5073677db384"
        name                    = "appinsights-instrumentation-key"
        tags                    = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "appinsights civil-citizen-ui-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be destroyed
  # (because azurerm_application_insights.this is not in configuration)
  - resource "azurerm_application_insights" "this" {
      - app_id                                = "4559f2e9-97cf-46ca-873a-bb1115625aba" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value)
      - daily_data_cap_in_gb                  = 50 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.Insights/components/civil-citizen-ui-aat" -> null
      - instrumentation_key                   = (sensitive value)
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "civil-citizen-ui-aat" -> null
      - resource_group_name                   = "civil-citizen-ui-aat" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "application"         = "civil"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
        } -> null
      - workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
    }

  # module.citizen-ui-draft-store.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Cache/redis/civil-citizen-ui-draft-store-aat"
        name                          = "civil-citizen-ui-draft-store-aat"
        tags                          = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 125 -> 642
          ~ maxmemory_delta                 = 125 -> 642
          ~ maxmemory_reserved              = 125 -> 642
            # (7 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2838,"Program":"tfcmt","SHA1":"","Vars":{}} -->